blasius_laminar_flow_github/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientPlanes
    {
        type            patch;
        nFaces          200;
        startFace       15820;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       16020;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       16120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       16180;
    }
)

// ************************************************************************* //
