blasius_laminar_flow_github/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)  //0
    (1 0 0)  //1
    (1 1 0)  //2
    (0 1 0)  //3
    (0 0 0.1)  //4
    (1 0 0.1)  //5
    (1 1 0.1)  //6
    (0 1 0.1)  //7
    (6 0 0)  //8
    (6 1 0)  //9
    (6 0 0.1)  //10
    (6 1 0.1)  //11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 100 1) simpleGrading (0.2 20 1)
    hex (1 8 9 2 5 10 11 6) (60 100 1) simpleGrading (6 20 1)
);

edges
(
);

boundary
(
    zeroGradientPlanes
    {
        type patch;
        faces
        (
            (1 5 4 0) //bottom left side(x=0,1 y=0)
            (8 9 11 10) //right side out let(x=2 plane)
            (3 7 6 2) //x=0x=1top y
            (2 6 11 9) //x=1x=2top y
         );
    }

   inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) //x=0
         );
    }

   plate
    {
        type wall;
        faces
        (
            (1 8 10 5) //this is flat_plate,y=0,x=1and x=2
         );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
          );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
